tutorial/turbine-tower/fluid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


xmin  -300;
xmax   300; //600

ymin  -100; //100
ymax   100;

zmin     0;
zmax   300; //300


vertices
(
    ($xmax $ymax $zmin )         // 0
    ($xmin $ymax $zmin )         // 1
    ($xmin $ymin $zmin )         // 2
    ($xmax $ymin $zmin )         // 3

    ($xmax $ymax $zmax )         // 4
    ($xmin $ymax $zmax )         // 5
    ($xmin $ymin $zmax )         // 6
    ($xmax $ymin $zmax )         // 7
);

blocks
(
    hex (   0   1   2   3   4  5  6  7  )
    (60 20 30)
    simpleGrading (1 1 1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (1 2 5 6)
        );
    }    
    outlet
    {
        type patch;
        faces
        (
            (3 0 4 7)
        );
    }    
    floor
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }   

    externalDomain_1
    {
        type symmetryPlane;
        faces
        (
            (0 1 4 5)
        );
    }
    externalDomain_2
    {
        type symmetryPlane;
        faces
        (
            (2 3 6 7)
        );
    }
 

);
