tutorial/turbine-tower/fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh    dynamicOversetFvMesh;

motionSolverLibs (fvMotionSolvers);

solver           displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity quadratic inverseDistance (tower);
}

