tutorial/turbine-tower/fluid/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }

    tower
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    floor
    {
        type            fixedFluxPressure;
        value           $internalField;
    }    

    "externalDomain_.*"
    {
        type            symmetryPlane;
    }

}

// ************************************************************************* //
