tutorial/turbine-tower/fluid/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/initialConditions";

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
   
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }

    atmosphere
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }

    tower
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "externalDomain_.*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
